import java.util.List;

public class Template {

    /************************************************************************
     * Конструктор
     */


    /*************************************************************************
     * Статусы
     */
    private boolean GET_STATUS;
    private boolean APPEND_STATUS;
    private boolean INSERT_STATUS;
    private boolean REMOVE_STATUS;
    private boolean GET_STATUS;
    private boolean SIZE_STATUS;

    /*************************************************************************
     * Команды
     */
    // предусловие:
    // постусловие:

    /*************************************************************************
     * Запросы
     */


    /*************************************************************************
     * Запросы статусов
     */
    // успешно; список пуст; элемент не доступен


}
