public class Queue<T> {
    /*************************************************************************
     * Статусы
     */
    private boolean DEQUEUE_STATUS;
    private boolean QUEUE_STATUS;


    /************************************************************************
     * Конструктор
     */
    // постусловие: пустая очередь
    public Queue(){ }


    /*************************************************************************
     * Команды
     */
    // постусловие: в конце очереди появляется новый элемент
    public void enqueue(T item) { }

    // предусловие: очередь пне пустая
    // постусловие: из начала очереди удаляется элемент
    public T dequeue() { }

    /*************************************************************************
     * Запросы
     */
    public int size() { } // текущий размер очерди


    /*************************************************************************
     * Запросы статусов
     */
    // успешно; список пуст;
    public boolean getDequeueStatus() { }

    // успешно; элемент не вставлен
    public boolean getQueueStatus() { }
}